app/views/patients/index.html.erb

<a>Current Medications: </a>
<% patient.medications.each do |medication| %>
---
SELECT `medications`.* FROM `medications` INNER JOIN `patient_medications` ON `medications`.`id` = `patient_medications`.`medication_id` WHERE `patient_medications`.`patient_id` = ?  [[nil, 10]]