app/views/patients/index.html.haml

  %a Current Medications:
  - patient.medications.each do |medication|
---
SELECT `medications`.* FROM `medications` INNER JOIN `patient_medications` ON `medications`.`id` = `patient_medications`.`medication_id` WHERE `patient_medications`.`patient_id` = ?  [["patient_id", 10]]