app/controllers/home_controller.rb

SELECT `patients`.* FROM `patients`
---
	def index
		@patients = Patient.all