app/controllers/hospitals_controller.rb

SELECT `hospitals`.* FROM `hospitals`
---
	def index
		@hospitals = if !params[:q].blank?
			Hospital.where("name LIKE ? OR description Like ?", "%#{params[:q]}%", "%#{params[:q]}%")
		else
			Hospital.all

SELECT  `hospitals`.* FROM `hospitals` WHERE `hospitals`.`id` = ? LIMIT 1  [["id", 1]]
---
	def show
		@hospital = Hospital.find params[:id]

SELECT  `hospitals`.* FROM `hospitals` WHERE `hospitals`.`id` = ? LIMIT 1  [["id", 1]]
---
	def edit
		@hospital = Hospital.find params[:id]

INSERT INTO `hospitals` (`name`, `description`, `address`, `city`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?)  [["name", "MUSC"], ["description", "Eye Center"], ["address", "12 bee st"], ["city", "Charleston"], ["created_at", "2015-01-23 20:26:19"], ["updated_at", "2015-01-23 20:26:19"]]
---
	def create
		@hospital = Hospital.new(hospital_params)
			if @hospital.save

SELECT  `hospitals`.* FROM `hospitals` WHERE `hospitals`.`id` = ? LIMIT 1  [["id", 1]]
UPDATE `hospitals` SET `address` = ?, `updated_at` = ? WHERE `hospitals`.`id` = ?  [["address", "14 bee st"], ["updated_at", "2015-01-25 19:37:59"], ["id", 1]]
---
	def update
		@hospital = Hospital.find params[:id]
		@hospital.update(hospital_params)

SELECT  `hospitals`.* FROM `hospitals` WHERE `hospitals`.`id` = ? LIMIT 1  [["id", 2]]
DELETE FROM `hospitals` WHERE `hospitals`.`id` = ?  [["id", 2]]
---
	def destroy
		@hospital = Hospital.find params[:id]
		@hospital.delete