app/controllers/medications_controller.rb

SELECT  `medications`.* FROM `medications` WHERE `medications`.`id` = ? LIMIT 1  [["id", 18]]
---
	def edit
		@medication = Medication.find params[:id]

SELECT  `medications`.* FROM `medications` WHERE `medications`.`id` = ? LIMIT 1  [["id", 18]]
---
	def update
		@medication = Medication.find params[:id]