app/controllers/medications_controller.rb

SELECT  `hospitals`.* FROM `hospitals` WHERE `hospitals`.`id` = ? LIMIT 1  [["id", 1]]
SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = ? LIMIT 1  [["id", 10]]
SELECT `medications`.* FROM `medications`
---
	def index
		@hospital = Hospital.find params[:hospital_id]
		@patient = Patient.find params[:patient_id]
		@medications = Medication.all

SELECT  `hospitals`.* FROM `hospitals` WHERE `hospitals`.`id` = ? LIMIT 1  [["id", 1]]
SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = ? LIMIT 1  [["id", 10]]
---
	def show
		@hospital = Hospital.find params[:hospital_id]
		@patient = Patient.find params[:patient_id]

SELECT  `hospitals`.* FROM `hospitals` WHERE `hospitals`.`id` = ? LIMIT 1  [["id", 1]]
SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = ? LIMIT 1  [["id", 10]]
---
	def new
		@hospital = Hospital.find params[:hospital_id]
		@patient = Patient.find params[:patient_id]

SELECT  `hospitals`.* FROM `hospitals` WHERE `hospitals`.`id` = ? LIMIT 1  [["id", 1]]
SELECT  `patients`.* FROM `patients` WHERE `patients`.`hospital_id` = ? AND `patients`.`id` = ? LIMIT 1  [["hospital_id", 1], ["id", 10]]
INSERT INTO `medications` (`name`, `dose`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?)  [["name", "Xanax"], ["dose", "20mg"], ["created_at", "2015-01-26 19:50:14"], ["updated_at", "2015-01-26 19:50:14"]]
INSERT INTO `patient_medications` (`patient_id`, `medication_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?)  [["patient_id", 10], ["medication_id", 17], ["created_at", "2015-01-26 21:48:48"], ["updated_at", "2015-01-26 21:48:48"]]
---
	def create
		@hospital = Hospital.find params[:hospital_id]
		@patient = @hospital.patients.find params[:patient_id]
		@medication = @patient.medications.create med_params

SELECT  `hospitals`.* FROM `hospitals` WHERE `hospitals`.`id` = ? LIMIT 1  [["id", 1]]
SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = ? LIMIT 1  [["id", 10]]
---
	def edit
		@hospital = Hospital.find params[:hospital_id]
		@patient = Patient.find params[:patient_id]

SELECT  `hospitals`.* FROM `hospitals` WHERE `hospitals`.`id` = ? LIMIT 1  [["id", nil]]
UPDATE `medications` SET `dose` = ?, `updated_at` = ? WHERE `medications`.`id` = ?  [["dose", "4220mg"], ["updated_at", "2015-01-27 23:20:20"], ["id", 18]]
---
	def update
		@hospital = Hospital.find params[:hospital_id]
		@patient = Patient.find params[:patient_id]
		@medication.update_attributes med_params

SELECT  `hospitals`.* FROM `hospitals` WHERE `hospitals`.`id` = ? LIMIT 1  [["id", 1]]
SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = ? LIMIT 1  [["id", 10]]
SELECT  `medications`.* FROM `medications` WHERE `medications`.`id` = ? LIMIT 1  [["id", 15]]
DELETE FROM `medications` WHERE `medications`.`id` = ?  [["id", 15]]
---
	def destroy
		@hospital = Hospital.find params[:hospital_id]
		@patient = Patient.find params[:patient_id]
		@medication = Medication.find params[:id]
		@medication.destroy