app/controllers/patients_controller.rb

SELECT  `hospitals`.* FROM `hospitals` WHERE `hospitals`.`id` = ? LIMIT 1  [["id", 3]]
SELECT `patients`.* FROM `patients`
---
	def index
		@hospital = Hospital.find params[:hospital_id]
		@patients = Patient.all

SELECT  `hospitals`.* FROM `hospitals` WHERE `hospitals`.`id` = ? LIMIT 1  [["id", 1]]
---
	def new
		@hospital = Hospital.find params[:hospital_id]

SELECT  `hospitals`.* FROM `hospitals` WHERE `hospitals`.`id` = ? LIMIT 1  [["id", 1]]
INSERT INTO `patients` (`first_name`, `last_name`, `description`, `blood_type`, `dob`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?)  [["first_name", "Henry"], ["last_name", ""], ["description", ""], ["blood_type", ""], ["dob", "2015-01-21"], ["created_at", "2015-01-21 20:37:23"], ["updated_at", "2015-01-21 20:37:23"]]
---
	def create
		@hospital = Hospital.find params[:hospital_id]
		@patient = @hospital.patients.create que_params

SELECT  `hospitals`.* FROM `hospitals` WHERE `hospitals`.`id` = ? LIMIT 1  [["id", 1]]
SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = ? LIMIT 1  [["id", 1]]
---
	def edit
		@hospital = Hospital.find params[:hospital_id]
		@patient = Patient.find params[:id]

SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = ? LIMIT 1  [["id", 3]]
UPDATE `patients` SET `last_name` = ?, `description` = ?, `gender` = ?, `blood_type` = ?, `dob` = ?, `updated_at` = ? WHERE `patients`.`id` = ?  [["last_name", "John"], ["description", "severed head"], ["gender", "male"], ["blood_type", "O+"], ["dob", "2010-09-23"], ["updated_at", "2015-01-21 20:37:42"], ["id", 2]]
---
	def update
		@patient = Patient.find params[:id]
		@patient.update_attributes que_params

SELECT  `hospitals`.* FROM `hospitals` WHERE `hospitals`.`id` = ? LIMIT 1  [["id", 1]]
SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = ? LIMIT 1  [["id", 2]]
---
	def show
		@hospital = Hospital.find params[:hospital_id]
		@patient = Patient.find params[:id]

SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = ? LIMIT 1  [["id", 1]]
DELETE FROM `patients` WHERE `patients`.`id` = ?  [["id", 1]]
---
	def destroy
		@patient = Patient.find params[:id]
		@patient.delete